logs/16threads/10-10-1-15/dsb-result_node5_threads16_conn16_mixed-workload_network_socfb-Reed98-mode-numa-membind-2.log

CONFIG: node:5 threads:16 conn:16 workload:mixed-workload network:socfb-Reed98 RPS:1000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080
  16 threads and 16 connections

  Thread calibration: mean lat.: 8.770ms, rate sampling interval: 33ms
  Thread calibration: mean lat.: 10.093ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 12.046ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 12.218ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 10.272ms, rate sampling interval: 36ms
  Thread calibration: mean lat.: 11.402ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 10.818ms, rate sampling interval: 35ms
  Thread calibration: mean lat.: 12.846ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 14.503ms, rate sampling interval: 53ms
  Thread calibration: mean lat.: 10.489ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 13.923ms, rate sampling interval: 50ms
  Thread calibration: mean lat.: 7.935ms, rate sampling interval: 28ms
  Thread calibration: mean lat.: 12.162ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 12.938ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 13.055ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 12.577ms, rate sampling interval: 43ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    13.51ms    8.38ms  43.42ms   80.22%
    Req/Sec    62.29     36.18   147.00     69.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   10.74ms
 75.000%   16.58ms
 90.000%   23.95ms
 99.000%   43.42ms
 99.900%   72.00ms
 99.990%  102.78ms
 99.999%  121.60ms
100.000%  121.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.121     0.000000            1         1.00
       6.163     0.100000         4952         1.11
       8.111     0.200000         9899         1.25
       8.935     0.300000        14886         1.43
       9.687     0.400000        19801         1.67
      10.743     0.500000        24757         2.00
      11.495     0.550000        27217         2.22
      12.471     0.600000        29695         2.50
      13.671     0.650000        32170         2.86
      15.079     0.700000        34644         3.33
      16.575     0.750000        37134         4.00
      17.375     0.775000        38355         4.44
      18.287     0.800000        39593         5.00
      19.327     0.825000        40829         5.71
      20.575     0.850000        42061         6.67
      22.127     0.875000        43300         8.00
      23.007     0.887500        43917         8.89
      23.951     0.900000        44538        10.00
      25.087     0.912500        45155        11.43
      26.351     0.925000        45772        13.33
      27.871     0.937500        46393        16.00
      28.831     0.943750        46700        17.78
      29.823     0.950000        47009        20.00
      30.751     0.956250        47319        22.86
      31.967     0.962500        47628        26.67
      33.663     0.968750        47937        32.00
      34.687     0.971875        48091        35.56
      35.711     0.975000        48245        40.00
      36.927     0.978125        48402        45.71
      38.175     0.981250        48559        53.33
      39.775     0.984375        48712        64.00
      40.671     0.985938        48790        71.11
      41.631     0.987500        48867        80.00
      42.687     0.989062        48944        91.43
      43.903     0.990625        49019       106.67
      45.567     0.992188        49096       128.00
      46.463     0.992969        49135       142.22
      47.679     0.993750        49173       160.00
      49.087     0.994531        49212       182.86
      50.367     0.995313        49252       213.33
      51.999     0.996094        49289       256.00
      53.215     0.996484        49309       284.44
      54.399     0.996875        49328       320.00
      56.223     0.997266        49348       365.71
      57.855     0.997656        49367       426.67
      60.639     0.998047        49386       512.00
      61.823     0.998242        49396       568.89
      62.879     0.998437        49405       640.00
      63.775     0.998633        49415       731.43
      68.031     0.998828        49425       853.33
      72.127     0.999023        49434      1024.00
      74.303     0.999121        49439      1137.78
      77.631     0.999219        49444      1280.00
      80.319     0.999316        49449      1462.86
      85.055     0.999414        49454      1706.67
      87.871     0.999512        49458      2048.00
      88.511     0.999561        49461      2275.56
      89.791     0.999609        49463      2560.00
      91.135     0.999658        49466      2925.71
      93.247     0.999707        49468      3413.33
      96.511     0.999756        49470      4096.00
      98.623     0.999780        49472      4551.11
     100.287     0.999805        49473      5120.00
     100.351     0.999829        49474      5851.43
     100.799     0.999854        49475      6826.67
     102.719     0.999878        49476      8192.00
     102.783     0.999890        49477      9102.22
     103.231     0.999902        49478     10240.00
     103.231     0.999915        49478     11702.86
     107.583     0.999927        49479     13653.33
     107.583     0.999939        49479     16384.00
     108.799     0.999945        49480     18204.44
     108.799     0.999951        49480     20480.00
     108.799     0.999957        49480     23405.71
     111.615     0.999963        49481     27306.67
     111.615     0.999969        49481     32768.00
     111.615     0.999973        49481     36408.89
     111.615     0.999976        49481     40960.00
     111.615     0.999979        49481     46811.43
     121.599     0.999982        49482     54613.33
     121.599     1.000000        49482          inf
#[Mean    =       13.513, StdDeviation   =        8.383]
#[Max     =      121.536, Total count    =        49482]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  59326 requests in 1.00m, 743.11MB read
Requests/sec:    988.71  
Transfer/sec:     12.38MB
*************************************************************

CONFIG: node:5 threads:16 conn:16 workload:mixed-workload network:socfb-Reed98 RPS:5000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080
  16 threads and 16 connections

  Thread calibration: mean lat.: 97.593ms, rate sampling interval: 355ms
  Thread calibration: mean lat.: 675.204ms, rate sampling interval: 2191ms
  Thread calibration: mean lat.: 1111.315ms, rate sampling interval: 3655ms
  Thread calibration: mean lat.: 1219.343ms, rate sampling interval: 3270ms
  Thread calibration: mean lat.: 724.136ms, rate sampling interval: 2555ms
  Thread calibration: mean lat.: 398.114ms, rate sampling interval: 1598ms
  Thread calibration: mean lat.: 927.311ms, rate sampling interval: 2744ms
  Thread calibration: mean lat.: 785.812ms, rate sampling interval: 2529ms
  Thread calibration: mean lat.: 719.251ms, rate sampling interval: 2299ms
  Thread calibration: mean lat.: 1094.566ms, rate sampling interval: 3317ms
  Thread calibration: mean lat.: 753.618ms, rate sampling interval: 2053ms
  Thread calibration: mean lat.: 977.842ms, rate sampling interval: 3180ms
  Thread calibration: mean lat.: 843.744ms, rate sampling interval: 2283ms
  Thread calibration: mean lat.: 617.674ms, rate sampling interval: 1571ms
  Thread calibration: mean lat.: 299.912ms, rate sampling interval: 1310ms
  Thread calibration: mean lat.: 641.148ms, rate sampling interval: 2134ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.06s     2.03s    7.89s    64.05%
    Req/Sec   293.86     27.28   366.00     74.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.82s 
 75.000%    4.64s 
 90.000%    5.84s 
 99.000%    7.89s 
 99.900%    8.28s 
 99.990%    8.37s 
 99.999%    8.40s 
100.000%    8.40s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.811     0.000000            1         1.00
     145.919     0.100000        22912         1.11
    1331.199     0.200000        45849         1.25
    1714.175     0.300000        68769         1.43
    2213.887     0.400000        91685         1.67
    2824.191     0.500000       114597         2.00
    3141.631     0.550000       126023         2.22
    3491.839     0.600000       137463         2.50
    3911.679     0.650000       148992         2.86
    4218.879     0.700000       160428         3.33
    4640.767     0.750000       171843         4.00
    4845.567     0.775000       177613         4.44
    5033.983     0.800000       183334         5.00
    5226.495     0.825000       189025         5.71
    5427.199     0.850000       194816         6.67
    5615.615     0.875000       200484         8.00
    5734.399     0.887500       203361         8.89
    5836.799     0.900000       206233        10.00
    5914.623     0.912500       209109        11.43
    6070.271     0.925000       211971        13.33
    6270.975     0.937500       214803        16.00
    6381.567     0.943750       216254        17.78
    6483.967     0.950000       217690        20.00
    6594.559     0.956250       219080        22.86
    6721.535     0.962500       220566        26.67
    6930.431     0.968750       221947        32.00
    7131.135     0.971875       222663        35.56
    7258.111     0.975000       223385        40.00
    7393.279     0.978125       224105        45.71
    7528.447     0.981250       224829        53.33
    7630.847     0.984375       225544        64.00
    7684.095     0.985938       225898        71.11
    7757.823     0.987500       226253        80.00
    7839.743     0.989062       226619        91.43
    7913.471     0.990625       226995       106.67
    7933.951     0.992188       227321       128.00
    7958.527     0.992969       227516       142.22
    7979.007     0.993750       227670       160.00
    8015.871     0.994531       227856       182.86
    8052.735     0.995313       228039       213.33
    8122.367     0.996094       228210       256.00
    8142.847     0.996484       228300       284.44
    8155.135     0.996875       228388       320.00
    8175.615     0.997266       228474       365.71
    8220.671     0.997656       228563       426.67
    8249.343     0.998047       228658       512.00
    8257.535     0.998242       228711       568.89
    8265.727     0.998437       228761       640.00
    8269.823     0.998633       228806       731.43
    8273.919     0.998828       228851       853.33
    8278.015     0.999023       228895      1024.00
    8282.111     0.999121       228917      1137.78
    8286.207     0.999219       228936      1280.00
    8294.399     0.999316       228943      1462.86
    8314.879     0.999414       228967      1706.67
    8335.359     0.999512       228990      2048.00
    8339.455     0.999561       229004      2275.56
    8343.551     0.999609       229016      2560.00
    8347.647     0.999658       229023      2925.71
    8351.743     0.999707       229032      3413.33
    8359.935     0.999756       229051      4096.00
    8359.935     0.999780       229051      4551.11
    8364.031     0.999805       229064      5120.00
    8364.031     0.999829       229064      5851.43
    8368.127     0.999854       229072      6826.67
    8368.127     0.999878       229072      8192.00
    8372.223     0.999890       229085      9102.22
    8372.223     0.999902       229085     10240.00
    8372.223     0.999915       229085     11702.86
    8372.223     0.999927       229085     13653.33
    8376.319     0.999939       229092     16384.00
    8376.319     0.999945       229092     18204.44
    8376.319     0.999951       229092     20480.00
    8376.319     0.999957       229092     23405.71
    8376.319     0.999963       229092     27306.67
    8380.415     0.999969       229093     32768.00
    8380.415     0.999973       229093     36408.89
    8384.511     0.999976       229094     40960.00
    8388.607     0.999979       229096     46811.43
    8388.607     0.999982       229096     54613.33
    8388.607     0.999985       229096     65536.00
    8388.607     0.999986       229096     72817.78
    8396.799     0.999988       229098     81920.00
    8396.799     0.999989       229098     93622.86
    8396.799     0.999991       229098    109226.67
    8396.799     0.999992       229098    131072.00
    8396.799     0.999993       229098    145635.56
    8396.799     0.999994       229098    163840.00
    8396.799     0.999995       229098    187245.71
    8396.799     0.999995       229098    218453.33
    8404.991     0.999996       229099    262144.00
    8404.991     1.000000       229099          inf
#[Mean    =     3057.431, StdDeviation   =     2026.623]
#[Max     =     8396.800, Total count    =       229099]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  272924 requests in 1.00m, 3.33GB read
Requests/sec:   4548.95  
Transfer/sec:     56.86MB
*************************************************************

CONFIG: node:5 threads:16 conn:16 workload:mixed-workload network:socfb-Reed98 RPS:10000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080
  16 threads and 16 connections

  Thread calibration: mean lat.: 2887.495ms, rate sampling interval: 10518ms
  Thread calibration: mean lat.: 2282.608ms, rate sampling interval: 7909ms
  Thread calibration: mean lat.: 2752.926ms, rate sampling interval: 10321ms
  Thread calibration: mean lat.: 2156.158ms, rate sampling interval: 7745ms
  Thread calibration: mean lat.: 2899.604ms, rate sampling interval: 10543ms
  Thread calibration: mean lat.: 2233.332ms, rate sampling interval: 7876ms
  Thread calibration: mean lat.: 2744.913ms, rate sampling interval: 8904ms
  Thread calibration: mean lat.: 2812.349ms, rate sampling interval: 10125ms
  Thread calibration: mean lat.: 2763.871ms, rate sampling interval: 10280ms
  Thread calibration: mean lat.: 2707.982ms, rate sampling interval: 10084ms
  Thread calibration: mean lat.: 2744.431ms, rate sampling interval: 10166ms
  Thread calibration: mean lat.: 2826.010ms, rate sampling interval: 10199ms
  Thread calibration: mean lat.: 2990.748ms, rate sampling interval: 10706ms
  Thread calibration: mean lat.: 3006.776ms, rate sampling interval: 10493ms
  Thread calibration: mean lat.: 2985.050ms, rate sampling interval: 10289ms
  Thread calibration: mean lat.: 2806.454ms, rate sampling interval: 9789ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    18.70s     8.20s   34.54s    60.88%
    Req/Sec   289.82     43.18   365.00     69.44%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   18.27s 
 75.000%   24.94s 
 90.000%   30.77s 
 99.000%   34.54s 
 99.900%   35.16s 
 99.990%   35.29s 
 99.999%   35.32s 
100.000%   35.32s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4272.127     0.000000            3         1.00
    7827.455     0.100000        22737         1.11
   10461.183     0.200000        45450         1.25
   13058.047     0.300000        68190         1.43
   15654.911     0.400000        90933         1.67
   18268.159     0.500000       113635         2.00
   19595.263     0.550000       125006         2.22
   20971.519     0.600000       136375         2.50
   22331.391     0.650000       147836         2.86
   23625.727     0.700000       159146         3.33
   24936.447     0.750000       170535         4.00
   25673.727     0.775000       176121         4.44
   26509.311     0.800000       181845         5.00
   27525.119     0.825000       187527         5.71
   28639.231     0.850000       193188         6.67
   29704.191     0.875000       198897         8.00
   30228.479     0.887500       201674         8.89
   30769.151     0.900000       204535        10.00
   31293.439     0.912500       207414        11.43
   31817.727     0.925000       210239        13.33
   32342.015     0.937500       213086        16.00
   32604.159     0.943750       214515        17.78
   32866.303     0.950000       215936        20.00
   33128.447     0.956250       217298        22.86
   33390.591     0.962500       218773        26.67
   33652.735     0.968750       220267        32.00
   33783.807     0.971875       220976        35.56
   33914.879     0.975000       221696        40.00
   34045.951     0.978125       222343        45.71
   34177.023     0.981250       223039        53.33
   34308.095     0.984375       223737        64.00
   34373.631     0.985938       224059        71.11
   34439.167     0.987500       224405        80.00
   34504.703     0.989062       224785        91.43
   34570.239     0.990625       225094       106.67
   34668.543     0.992188       225515       128.00
   34701.311     0.992969       225653       142.22
   34766.847     0.993750       225915       160.00
   34799.615     0.994531       226036       182.86
   34865.151     0.995313       226242       213.33
   34897.919     0.996094       226343       256.00
   34930.687     0.996484       226435       284.44
   34963.455     0.996875       226534       320.00
   34996.223     0.997266       226633       365.71
   35028.991     0.997656       226743       426.67
   35061.759     0.998047       226852       512.00
   35061.759     0.998242       226852       568.89
   35094.527     0.998437       226928       640.00
   35094.527     0.998633       226928       731.43
   35127.295     0.998828       226974       853.33
   35160.063     0.999023       227034      1024.00
   35160.063     0.999121       227034      1137.78
   35192.831     0.999219       227087      1280.00
   35192.831     0.999316       227087      1462.86
   35225.599     0.999414       227134      1706.67
   35225.599     0.999512       227134      2048.00
   35225.599     0.999561       227134      2275.56
   35258.367     0.999609       227181      2560.00
   35258.367     0.999658       227181      2925.71
   35258.367     0.999707       227181      3413.33
   35258.367     0.999756       227181      4096.00
   35258.367     0.999780       227181      4551.11
   35258.367     0.999805       227181      5120.00
   35291.135     0.999829       227209      5851.43
   35291.135     0.999854       227209      6826.67
   35291.135     0.999878       227209      8192.00
   35291.135     0.999890       227209      9102.22
   35291.135     0.999902       227209     10240.00
   35291.135     0.999915       227209     11702.86
   35291.135     0.999927       227209     13653.33
   35323.903     0.999939       227224     16384.00
   35323.903     1.000000       227224          inf
#[Mean    =    18701.241, StdDeviation   =     8195.799]
#[Max     =    35291.136, Total count    =       227224]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  272875 requests in 1.00m, 3.33GB read
Requests/sec:   4548.06  
Transfer/sec:     56.83MB
*************************************************************

CONFIG: node:5 threads:16 conn:16 workload:mixed-workload network:socfb-Reed98 RPS:100000 numa-config:numa-membind-2
*************************************************************
Running 1m test @ http://localhost:8080
  16 threads and 16 connections

  Thread calibration: mean lat.: 4964.166ms, rate sampling interval: 17448ms
  Thread calibration: mean lat.: 4959.946ms, rate sampling interval: 16990ms
  Thread calibration: mean lat.: 4764.865ms, rate sampling interval: 16973ms
  Thread calibration: mean lat.: 4692.589ms, rate sampling interval: 17022ms
  Thread calibration: mean lat.: 4865.224ms, rate sampling interval: 17350ms
  Thread calibration: mean lat.: 4713.836ms, rate sampling interval: 17170ms
  Thread calibration: mean lat.: 4747.930ms, rate sampling interval: 17137ms
  Thread calibration: mean lat.: 4784.763ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 4480.666ms, rate sampling interval: 16793ms
  Thread calibration: mean lat.: 4712.676ms, rate sampling interval: 17285ms
  Thread calibration: mean lat.: 4739.717ms, rate sampling interval: 17154ms
  Thread calibration: mean lat.: 4804.728ms, rate sampling interval: 17039ms
  Thread calibration: mean lat.: 4784.437ms, rate sampling interval: 17219ms
  Thread calibration: mean lat.: 4867.869ms, rate sampling interval: 17235ms
  Thread calibration: mean lat.: 4770.757ms, rate sampling interval: 17022ms
  Thread calibration: mean lat.: 4709.453ms, rate sampling interval: 17022ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    33.17s    13.71s    0.94m    57.80%
    Req/Sec   287.28     40.79   375.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   33.16s 
 75.000%   45.02s 
 90.000%    0.87m 
 99.000%    0.94m 
 99.900%    0.96m 
 99.990%    0.96m 
 99.999%    0.96m 
100.000%    0.96m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9437.183     0.000000            1         1.00
   14270.463     0.100000        22885         1.11
   18989.055     0.200000        45824         1.25
   23674.879     0.300000        68714         1.43
   28442.623     0.400000        91576         1.67
   33161.215     0.500000       114473         2.00
   35323.903     0.550000       125832         2.22
   37650.431     0.600000       137307         2.50
   40075.263     0.650000       148784         2.86
   42532.863     0.700000       160263         3.33
   45023.231     0.750000       171701         4.00
   46235.647     0.775000       177329         4.44
   47480.831     0.800000       183123         5.00
   48693.247     0.825000       188776         5.71
   49905.663     0.850000       194484         6.67
   51118.079     0.875000       200218         8.00
   51740.671     0.887500       203125         8.89
   52363.263     0.900000       205988        10.00
   52953.087     0.912500       208765        11.43
   53575.679     0.925000       211734        13.33
   54165.503     0.937500       214499        16.00
   54493.183     0.943750       216057        17.78
   54788.095     0.950000       217448        20.00
   55083.007     0.956250       218836        22.86
   55377.919     0.962500       220311        26.67
   55640.063     0.968750       221656        32.00
   55803.903     0.971875       222471        35.56
   55934.975     0.975000       223110        40.00
   56098.815     0.978125       223898        45.71
   56229.887     0.981250       224524        53.33
   56393.727     0.984375       225307        64.00
   56459.263     0.985938       225614        71.11
   56557.567     0.987500       226036        80.00
   56623.103     0.989062       226307        91.43
   56721.407     0.990625       226686       106.67
   56819.711     0.992188       227019       128.00
   56885.247     0.992969       227231       142.22
   56950.783     0.993750       227448       160.00
   56983.551     0.994531       227558       182.86
   57049.087     0.995313       227773       213.33
   57114.623     0.996094       227964       256.00
   57147.391     0.996484       228053       284.44
   57180.159     0.996875       228140       320.00
   57212.927     0.997266       228222       365.71
   57245.695     0.997656       228305       426.67
   57278.463     0.998047       228388       512.00
   57278.463     0.998242       228388       568.89
   57311.231     0.998437       228464       640.00
   57343.999     0.998633       228536       731.43
   57343.999     0.998828       228536       853.33
   57376.767     0.999023       228601      1024.00
   57376.767     0.999121       228601      1137.78
   57409.535     0.999219       228660      1280.00
   57409.535     0.999316       228660      1462.86
   57409.535     0.999414       228660      1706.67
   57442.303     0.999512       228712      2048.00
   57442.303     0.999561       228712      2275.56
   57442.303     0.999609       228712      2560.00
   57442.303     0.999658       228712      2925.71
   57475.071     0.999707       228759      3413.33
   57475.071     0.999756       228759      4096.00
   57475.071     0.999780       228759      4551.11
   57475.071     0.999805       228759      5120.00
   57475.071     0.999829       228759      5851.43
   57475.071     0.999854       228759      6826.67
   57475.071     0.999878       228759      8192.00
   57475.071     0.999890       228759      9102.22
   57507.839     0.999902       228782     10240.00
   57507.839     1.000000       228782          inf
#[Mean    =    33174.365, StdDeviation   =    13713.590]
#[Max     =    57475.072, Total count    =       228782]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  275626 requests in 1.00m, 3.37GB read
  Socket errors: connect 0, read 0, write 0, timeout 349
Requests/sec:   4593.93  
Transfer/sec:     57.45MB
*************************************************************